; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared2 - mode
	spectrograph1 - mode
	thermograph0 - mode
	GroundStation2 - direction
	Star3 - direction
	Star5 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star1 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(have_image Star6 spectrograph1)
	(have_image Planet7 thermograph0)
	(have_image Phenomenon8 thermograph0)
	(have_image Planet9 infrared2)
	(have_image Star10 thermograph0)
	(have_image Star11 spectrograph1)
))

)

; plan
1. (turn_to satellite1 star1 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star1)
   goals met: 0 of 7
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite1 phenomenon8 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon8)
   goals met: 0 of 7
5. (turn_to satellite0 groundstation0 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 7
6. (take_image satellite1 phenomenon8 instrument2 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 1 of 7
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
8. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 1 of 7
9. (turn_to satellite0 planet7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet7)
   goals met: 1 of 7
10. (take_image satellite0 planet7 instrument0 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 2 of 7
11. (turn_to satellite0 planet9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet9)
   goals met: 2 of 7
12. (take_image satellite0 planet9 instrument0 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 3 of 7
13. (turn_to satellite0 groundstation4 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation4)
   goals met: 4 of 7
14. (turn_to satellite1 star10 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star10)
   goals met: 4 of 7
15. (take_image satellite1 star10 instrument2 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 5 of 7
16. (turn_to satellite1 star11 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star11)
   goals met: 5 of 7
17. (take_image satellite1 star11 instrument2 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 6 of 7
18. (turn_to satellite1 star6 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star6)
   goals met: 6 of 7
19. (take_image satellite1 star6 instrument2 spectrograph1)
   added: (have_image star6 spectrograph1)
   goals met: 7 of 7
